[
  {
    "text": "2025 Global Automotive Consumer Study Key Findings: INDIA April 2025",
    "page": 1,
    "is_structured": false,
    "start_word": 0,
    "end_word": 10
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 2Foreword The Union Budget 2025 reaffirms government support for domestic manufacturing, infrastructure and demand growth. Tax exemptions are expected to boost sales in the two -wheeler and entry -level four -wheeler segments. Measures to rationalise duties on critical EV components and promote local production will strengthen the EV ecosystem. Recognising the evolving challenges in the automotive industry, the Global Automotive Consumer Study was initiated over a decade ago to better understand market trends from a consumer -driven perspective. This report highlights key insights across four core areas: EV adoption, future purchasing preferences, connectivity and shared mobility. As India's automotive landscape transforms, integrating innovation, regulatory policies and consumer expectations will be critical to long -term growth. This study aims to provide industry leaders with actionable insights to successfully navigate the future © 2025 Deloitte Touche Tohmatsu India LLP. The Indian automotive industry is transforming significantly, driven by evolving consumer preferences, regulatory shifts and rapid technological advancements. While interest in hybrids and All -Battery -Powered Electric Vehicles (BEVs) persists, Indian consumers are also exploring Internal Combustion Engine (ICE) options, influenced by affordability considerations and anxieties associated with EVs. EVs continue to attract interest due to their environmental benefits and cost savings. Consumers acknowledge the promise of lower emissions and reduced fuel and maintenance costs; however, affordability remains a key challenge. Many are open to paying more for EVs, provided concerns around charging infrastructure, range and battery costs are addressed. The most important aspect of an EV charging experience, is “fast charging”. A pragmatic approach to charging infrastructure that focuses on accessibility and reliability is essential. A growing number of consumers are considering switching brands, driven by the desire to try something new and upgrade to a premium brand. This trend reinforces the need for deeper customer engagement. Younger consumers, are increasingly open to giving up traditional vehicle ownership in favour of Mobility -as-a-Service ( MaaS ) solutions, reflecting evolving financial and lifestyle considerations. Rajat Mahajan Partner and Automotive Sector Leader, Deloitte India rajatm@deloitte.com",
    "page": 2,
    "is_structured": false,
    "start_word": 0,
    "end_word": 343
  },
  {
    "text": "Presentation title [To edit, click View > Slide Master > Slide Master]© 2025 Deloitte Touche Tohmatsu India LLP. 3 Key Findings 4 1 Vehicle electrification 5 2 Future vehicle intentions 16 3 Connectivity 26 4 Mobility as a Service (MAAS) 31 5 About the study 34 6 Connect with us 36 7Contents",
    "page": 3,
    "is_structured": false,
    "start_word": 0,
    "end_word": 52
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 4Key findings Source: Global Automobile Consumer Survey 2025 Consumers weigh EV benefits against practical challenges While interest in hybrids and Battery Electric Vehicles (BEVs) persists, some Indian customers are also exploring gasoline and diesel options, influenced by affordability considerations. Factors such as charging times, infrastructure availability and battery safety remain key considerations in EV adoption. A significant number of customers may be thinking about switching vehicle brands A growing number of customers are looking to switch brands, with product quality, vehicle performance and features emerging as the top three factors influencing their choice for the next vehicle. Brand affinity remains strongest for domestic automakers among customers. Indian customers willing to pay more and share data for anti -theft tracking About 88 percent of Indian customers are willing to pay extra and share their personally identifiable information in exchange for anti - theft tracking updates, a trend also observed in other economies. Younger customers show interest in MaaS over ownership amid financial concerns A large share of 18 –34-year -olds prefer shifting from traditional vehicle ownership to Mobility as a Service ( MaaS ) due to economic uncertainty. Nearly two -thirds expect to pay under INR30,000 per month for their next vehicle.",
    "page": 4,
    "is_structured": true
  },
  {
    "text": "Vehicle electrification 2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 5",
    "page": 5,
    "is_structured": false,
    "start_word": 0,
    "end_word": 15
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 6While interest in hybrids and BEVs remains, Indian customers are also evaluating gasoline and diesel vehicles, partly due to ongoing affordability concerns Preference for t ype of engine in next vehicle 0%5%8%12%21%54% 2%3%10%12%24%49% 1%6%8%12%20%53% Don’t knowOtherAll-Battery-powered Electric Vehicle (BEV)Plug-in Hybrid Electric Vehicle (PHEV)Hybrid Electric Vehicle (HEV)Gasoline/diesel 2023 SY 2024 SY 2025 SY Note: Other includes vehicles with engine types such as compressed natural gas, ethanol and hydrogen fuel cells; don’t know responses weren’t considered; SY stands for Study Year. Q41. What type of engine would you prefer in your next vehicle? Sample size: n= 957 [2023]; 864 [2024]; 882 [2025] Source: Global Automobile Consumer Survey 2025",
    "page": 6,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 7The appeal of EVs lies in their eco -friendly image, lower emissions and long -term savings on fuel and maintenance, making them a preferred sustainable choice Reasons for choosing an EV for next vehicle Lower fuel cost56% Concern for the environment63% Driving experience50% Less maintenance45% Government incentives/subsidies/ stimulus programmes45% Concern about personal health44% Potential for extra taxes/levies applied to internal combustion vehicles (diesel)31% 10% Peer pressure48% Ability to use the vehicle as a backup battery/power source Potential ban on sale of new internal combustion vehicles 30% #1Environmental concern is the second most important factor driving EV adoption in US, China and Japan. Q42. Which of the following factors have had the greatest impact on your decision to acquire an electrified vehicle? Please s elect all that apply. Sample size: n= 364 Source: Global Automobile Consumer Survey 2025",
    "page": 7,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 8Affordability remains a key challenge for the automotive industry, as three -fourths of customers expect to spend less than INR25 lakh on their next vehicle, yet many are open to paying more for an EV Preferred price ranges for next vehicle Overall ICE intender EV intender 5% 2% 19% 13% 25% 29% 24% 33% 16% 15% 10% 6% 1% 2%4% 17% 27% 27% 15% 8% 1%Less than INR5,00,000 INR5,00,000 to less than INR10,00,000 INR10,00,000 to less than INR15,00,000 INR15,00,000 to less than INR25,00,000 INR25,00,000 to less than INR50,00,000 INR50,00,000 or more Don't know/not sure21% 54%24% 49%15% 62% The proportion of respondents willing to spend less than INR25 lakh has declined from 80 percent in 2024, primarily driven by a decline in ICE vehicle intenders Q32. In which of the following price ranges will you be shopping for your next vehicle? (Please indicate what you would expec t to pay after any discounts and/or incentives that might be available). Sample size: [Overall] n= 838; [ICE intender] n= 474, [EV intender] n= 364 Source: Global Automobile Consumer Survey 2025",
    "page": 8,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 970 percent Indian EV buyers intend to charge their vehicles at home, making accessible home charging solutions and financing options essential to cover these additional costs Expecting to charge electrified vehicle most often at… Home 70%Work 18% On-street / public charging station 12% A larger proportion of respondents, 79 percent in the US and 72 percent in Japan, prefer charging their EVs at homeEV charger access among consumers who plan to charge their vehicle at home Yes, dedicated 44% Yes, shared with a neighbor/others 14%No 41%Don’t know 1% China leads among the surveyed countries, with 77 percent of EV intenders having a dedicated charger at their residence Q43: Where do you expect to charge your electrified vehicle most often?; Q44: Do you already have access to a charger at your residence? Sample size: n= 182 [Q43]; 128 [Q44] Source: Global Automobile Consumer Survey 2025",
    "page": 9,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 10Public EV charging investment in India is essential, as customers frequently drive long distances and prefer dedicated facilities for enhanced accessibility and technology How often did consumers drive more than 100 km from their homes last month? Preferred public charging location 2%3%3%3%6%12%23%49% Retail outlet/mallHotel or peer-to-peer rentalCommunity/public buildingOn-street parkingVehicle dealershipParking lotTraditional gas station with EV chargersDedicated EV charging station equipped with amenitiesNever 2% 1-2 times 28% 3-4 times 21%5-6 times 18%7 or more 32% India has the highest share of respondents who travelled over 100 km from home at least seven times in the past month among all surveyed economies. Q18: How many times in the past month have you driven more than 60 miles or 100 kilometres from your home? Q48: Where would you most want to charge your EV when you are away from home? Sample size: n= 646 [Q18]; 182 [Q43] Source: Global Automobile Consumer Survey 2025",
    "page": 10,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 11While fast charging is crucial for EV users, 69 percent of Indian customers are comfortable waiting up to 40 minutes, indicating that the push for ultra -fast charge times might be overstated The most important aspect of an EV charging experienceExpected wait time to charge an EV at public charging stations (from empty to 80 percent) 36% 24% 9% 7% 7% 6% 6% 4% 1%Fast charging time Accessibility of the charging station Number of available/functional chargers Location is easy to find/access Availability of amenities Personal security Ease of use Having a standard plug Easy payment optionsFewer Indian respondents now prioritise fast EV charging compared with last year, while the significance of charging station accessibility has increased.10 minutes or less 5% 11 to 20 minutes 23% 21 to 40 minutes 41%41 to 60 minutes 25%More than 60 minutes 5% Customers in surveyed markets like the US and China are willing to wait up to 40 minutes to charge Note: Percentage may not add up to 100 due to rounding. Q50: What is the most important aspect of an EV charging experience?; Q49: How long do you think it should take to charge an EV from fully discharged to 80% at a public charging location? Sample size: n = 182 [Q50]; 182 [Q49] Source: Global Automobile Consumer Survey 2025",
    "page": 11,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 12About 45 percent of Indian consumers prefer traditional credit/debit cards, but the rise in smartphone app payments highlights a shift towards digital and UPI transactions Most preferred way to pay for public EV charging Credit/debit card usage and smartphone app transactions in India have each increased by 3 percent over the past year, with UPI playing a pivotal role in smartphone -based payments.Credit/debit card 45% Smartphone app 31% Pre-paid subscription plan 11% Third -party payment platform 7% Loyalty points 5% Other 1% Q51: How would you most prefer to pay for public EV charging? Sample size: n= 182 Source: Global Automobile Consumer Survey 2025",
    "page": 12,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 13About 44 percent of BEV intenders expect a fully charged vehicle to offer a driving range of over 400 km, with higher expectations among urban and premium segment buyers Consumer expectations regarding BEV driving range By locationUrban 8% 20% 23% 19% 19% 10%48%Sub-Urban/Rural 11% 26% 25% 15% 11% 8%33%9% 21% 23% 18% 17% 9%Less than 200 kms 200 kms to 299 kms 300 kms to 399 kms 400 kms to 499 kms 500 kms to 599 kms 600 kms or more44%PremiumBy segment 7% 16% 15% 22% 28% 12%62%Non -premium 9% 24% 26% 17% 15% 9%41% Note: Did not consider those intenders who stated they would never acquire a BEV irrespective of the driving range. Q53: How far would a fully charged all -battery electric vehicle need to go in order for you to consider acquiring one? Sample size: n = 809 [Overall]; 626 [Urban], 183 [Sub -urban/Rural], 165 [Premium], 618 [Non -premium] Source: Global Automobile Consumer Survey 2025 A greater proportion of respondents, up from 40 percent last year, expect a range exceeding 400 km, driven mainly due to higher expectations among urban customers, while rural expectations remain unchanged.",
    "page": 13,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 14Charging time and infrastructure are key concerns, followed by driving range. Over a third of customers cite vehicle cost and battery replacement as major obstacles, emphasizing the need to address high prices Concerns regarding all battery -powered EVs Note: The sum of the percentages exceeds 100 percent as respondents can select multiple options; other values not shown Q52: What are your biggest concerns regarding all battery -powered EVs? Please select all that apply. Sample size: n= 882 Source: Global Automobile Consumer Survey 2025",
    "page": 14,
    "is_structured": false,
    "start_word": 0,
    "end_word": 95
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 15Surveyed Indian customers believe vehicle dealers, EV battery manufacturers and battery recycling companies should handle end -of-life EV batteries collection, storage and recycling Entity that should be responsible for collecting, storing and recycling EV batteries after their end -of-life (percentage of resp ondents) Q55: Who do you think should be responsible for collecting, storing and recycling electric vehicle batteries after their end -of-life? Sample size: n= 882 Source: Global Automobile Consumer Survey 2025 17% 17% 16% 12% 11% 9% 9% 6% 3%Vehicle dealer Battery manufacturer Dedicated battery recycling company A private environmental agency with/without government support Individual car manufacturer Charging network providers Government agency Automobile club or association Don't know/not sureCustomers in the US and India believe vehicle dealers and battery manufacturers should manage battery stewardship. In contrast, individual car manufacturers are considered the most trusted in Japan.",
    "page": 15,
    "is_structured": true
  },
  {
    "text": "Future vehicle intentions 2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 16",
    "page": 16,
    "is_structured": false,
    "start_word": 0,
    "end_word": 16
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 17The majority of Indian customers are loyal to their vehicle brands, but many are considering switching, emphasizing the need for stronger customer relationships to maintain long -term loyalty Percentage of consumers whose prior vehicle was from the same brand as current vehicle *includes switching to a different brand from the same parent or a different brand from a different sales parent Q6. Was your prior vehicle from the same brand? Q5. What brand is the vehicle you drive most often?; Q26. What brand are you considering most for your next vehicle? [Brand switching percentage is based on a calculation involving these two questions.] Sample size: n= 646 [Q6]; 633 [Q5, Q26] Source: Global Automobile Consumer Survey 2025 Yes 54%No 31%Current car is my first vehicle 14% About 54 percent of surveyed customers in India own the same brand as their previous vehicle, a trend that is slightly more prevalent in China and Japan.of Indian customers intend to switch vehicle brands,* marking a decline from 78 percent in the previous year.72%",
    "page": 17,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 1816%22%23%24%37%43%43%43%46%55%59%62% Previous sales experiencePrevious service experienceBrand affiliationsBrand advertisingAvailability of battery electric vehicles/hybrid optionsBrand familiarityPriceQuality of overall ownership experienceBrand imageVehicle featuresVehicle performanceProduct qualityProduct quality (including product safety), vehicle performance and features are the key factors influencing the choice of brand for the next vehicle for Indian customers Most important factors driving the choice of brand for your next vehicle (by type of engine in next vehicle) Note: The sum of the percentages exceeds 100 percent, as respondents can select multiple options. Q29. What are the most important factors driving the choice of brand for your next vehicle? (Please select all that apply). Sample size: n= 882 Source: Global Automobile Consumer Survey 2025 Product quality has ranked among the top three factors across economies, (like the US and China), while price is a key priority in Japan.",
    "page": 18,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 19Nearly half of the surveyed customers (49 percent) prefer domestic brands, with 72 percent prioritising local manufacturing in vehicle production, highlighting strong support for homegrown products Preferred organisations for next vehicle purchase Q54: From which of the following types of organisations are you most interested in acquiring your next vehicle?; Q31: To what extent is it important that your next vehicle be locally manufactured (i.e., manufactured in your country or region)? Sample size: n= 882 [Q54]; 882 [Q31] Source: Global Automobile Consumer Survey 2025 Percentage of consumers who give importance to local vehicle manufacturing (i.e., manufactured in your country or region) 10%19%31%41% Not important Somewhat importantImportant Very importantNearly half of UK customers do not consider local vehicle manufacturing important, the highest proportion among the surveyed economies. Domestic manufacturer/ brand Foreign manufacturer/ brand It does not matter as long as the vehicle meets my needs49% 21% 30%Three -fourths of surveyed customers in Japan prefer domestic manufacturers, the highest among all surveyed economies, followed by India",
    "page": 19,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 20About 87 percent of vehicle owners in India plan to buy new vehicles, with used buyers preferring models under three years old. Customers prioritise brands focused on sustainability Next vehicle type by current vehicle type Q24. Will your next vehicle be new or used? Q30: When thinking about choosing your next vehicle, how important will it be for a vehicle brand to have a strong commitment to sustainable practices (e.g., low carbon manufacturing footprint, use of environmentally friendly materia ls, electrification strategy)? Sample size: n = 981 [Q24]; 882 [Q30] Source: Global Automobile Consumer Survey 2025 Percentage of consumers who would give importance to vehicle brands that have a strong commitment to sustainable practices New 87%Nearly new/certified pre-owned (e.g., 1–3 years old) 9%Other used vehicle (e.g., 4 years old or more) 2%Don’t know 3% 56% 30% 12%Very important Important Somewhat important Not important 56% This year, 9 percent of surveyed users chose nearly new vehicles. In contrast, 96 percent opted for new vehicles last year, while only 2 percent chose old ones.The proportion of people who believe vehicle brands demonstrate a strong commitment to sustainable practices remains unchanged",
    "page": 20,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 21About 62 percent of Indian customers seek to switch vehicle brands, driven by new features and a desire for fresh experiences Q28. What is the main reason you plan to switch to another vehicle brand? Sample size: n = 705 [Q28]; Source: Global Automobile Consumer Survey 2025 1%2%5%6%11%13%27%35% OtherPoor customer experience with the current brandCost of current vehicle ownership is too highCurrent brand does not offer the type of vehicle I want nextAttractive incentives offered by the new brandUpgrading to a premium brand (including brands within the same parent company)I just want to try something differentNew brand has technology/features I wantKey reasons for switching to another brand of vehicle",
    "page": 21,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 22Indian customers are increasingly interested in buying vehicles and insurance directly from manufacturers as OEMs adopt 'agency' retail models, indicating a growing acceptance of this direct -to-consumer approach 8 out of 10 Indian customers are interested in purchasing insurance directly from the manufacturer, the highest among surveyed economies, followed by Chinaof Indian customers are interested in purchasing vehicles directly from manufacturers, the highest among surveyed economies, followed by China.76% 82% Sample size: 882 [Q61]; 882 [Q60]Q61: To what extent are you interested in acquiring your next vehicle directly from the manufacturer (via an online process)? Q60: The next time you acquire a vehicle, how interested would you be in purchasing insurance directly from the vehicle manufacturer? Source: Global Automobile Consumer Survey 2025",
    "page": 22,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 23Transitioning to a fully online vehicle purchase process in India may be challenging, as most of the surveyed customers prefer a physical interaction before making a purchase Note: The sum of the percentages exceeds 100 percent as respondents can select multiple options. Q40: Thinking about the next time you acquire a vehicle, to what extent do you agree or disagree with the following statement s? Sample size: n= 882 Source: Global Automobile Consumer Survey 2025 In most surveyed economies, except for Germany and South Korea, customers prioritise testing the vehicle or talking to a representative from the manufacturer as the most important aspect of the purchase experience. . 73%89%89%90%92%92% I prefer to limit the need to visit a dealership in personI want to build a relationship with a dealer for future serviceI want to negotiate in-person to get the best dealI want to interact with real peopleI have to test drive the vehicle to make sure it is right for meI need to physically interact with the vehicle before I buy itLevel of agreement on various aspects of the purchase experience (percentage somewhat/strongly agree)",
    "page": 23,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 24About 55 percent of customers in India plan to finance their next vehicle through a loan or lease, but their preferred term durations may not match market realities, as extended terms keep monthly payments affordable Q34. How do you intend to acquire your next vehicle?; Q35. What is your preferred loan duration (in months)?; Q36. What is yo ur preferred lease duration (in months)? Sample size: n= 882 [Q34]; 460 [Q35]; 28 [Q36] Source: Global Automobile Consumer Survey 2025 Similar to last year, nearly the same proportion of Indian customers prefer taking a loan with a tenure of four years or less. 52%40%3%2%1%1%0% Loan/financeCash purchaseLeaseCompany carSubscriptionLong-term rentalOther 2%3%3%31%22%30%10% 96 months or more84 months72 months60 months48 months36 months24 months or less Loan **Lease: Of the surveyed population, only 28 respondents chose leasing, with 20 preferring a lease term under 48 monthsPreferred intention of acquiring new vehicle Preferred loan and lease** duration",
    "page": 24,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 25When acquiring their next vehicle, Indian customers now prioritise offerings such as vehicle maintenance contracts, connected entertainment features and credit protection over traditional vehicle insurance Note: The sum of the percentages exceeds 100 percent as respondents can select multiple options. Q37: Which of the following additional services do you plan to purchase, or subscribe to, when acquiring your next vehicle? P lease select all that apply.? Sample size: n= 882 Source: Global Automobile Consumer Survey 2025 2%0.3%35%48%48%54%66% None of the aboveOtherHome EV charging equipmentRoadside assistanceCredit protectionConnected servicesService contractKey additional services consumers plan to purchase or subscribe to when acquiring their next vehicle",
    "page": 25,
    "is_structured": true
  },
  {
    "text": "Connectivity 2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 26",
    "page": 26,
    "is_structured": false,
    "start_word": 0,
    "end_word": 14
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 27Many respondents in India are concerned about fully autonomous robotaxi services and commercial vehicles operating autonomously on highways of customers in India are concerned about commercial vehicles operating in fully autonomous mode on highways —the highest among the surveyed economies —followed by the UK at 67%.of customers in India are concerned about fully autonomous robotaxi services operating in their area —the highest among the surveyed economies, followed by the UK at 52 percent63% 74% Q56. To what extent are you concerned with each of the following scenarios? Source: Global Automobile Consumer Survey 2025",
    "page": 27,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 28Indian customers are optimistic about tech, with 82 percent viewing AI as beneficial, and they prioritise vehicle -smartphone connectivity Q62: To what extent do you think the addition of artificial intelligence in vehicle systems (e.g., voice activated features, autonomous driving) will be beneficial? Q58. How important will it be for your next vehicle to connect with your smartphone via Apple CarPlay or Android Auto? Sample size: n= 882 [Q62]; 882 [Q58]Beneficial 82%Neutral 13%Not beneficial 5% of customers in India consider vehicle connectivity with smartphones to be somewhat or very important —the highest among the surveyed economies, followed by China at 80 percent.87% Source: Global Automobile Consumer Survey 2025 AI integration in vehicle systems",
    "page": 28,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 29Indian consumers are willing to share their PII* and pay extra for updates related to anti -theft tracking, emergency assistance and warranty/recall notices *personally identifiable information. Note: The sum of the percentages exceeds 100 percent as respondents can select multiple options . Q57: To what extent would you be willing to pay extra for each of the following connected vehicle services ? Sample size: n= 882 Source: Global Automobile Consumer Survey 2025 79%80%81%81%83%83%83%86%88% Infotainment functionsDigital keyApp connectivityAutomatic detection of vehicles and pedestriansInsurance plan based on your digital habitsVehicle health reporting and maintanenceWarranty/recall noticesEmergency assistanceAnti theft tracking Anti-theft tracking is among the top three preferred connected services in China, Japan and USReadiness to pay extra for features even if it requires sharing PII* and/or vehicle data",
    "page": 29,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 30About 44 percent of Indian customers place their highest trust in either OEMs or their dealers for managing the data collected from vehicles Q59: In a scenario where you owned a connected vehicle, who would you trust most with access to the data your vehicle generat es? Sample size: n= 882OEMs and vehicle dealers remain the most trusted entities for accessing vehicle - generated data, while trust in insurance companies has declined from last year 3%5%7%8%10%11%12%16%28% None of the aboveAutomobile club or associationCellular service providerCloud service providerInsurance companyFinancial service providerGovernment agencyVehicle dealerCar manufacturer Source: Global Automobile Consumer Survey 2025 Consumer opinions on whom they trust the most to manage data generated/collected by their vehicle",
    "page": 30,
    "is_structured": true
  },
  {
    "text": "Mobility as a Service ( MaaS ) 2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 31",
    "page": 31,
    "is_structured": false,
    "start_word": 0,
    "end_word": 20
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 32Despite high vehicle usage, many younger customers in India are open to giving up ownership for MaaS or subscription models due to financial concerns Sample size: n= 404 [Q63]; 404 [Q69]Q63: To what extent would you be willing to give up vehicle ownership in favour of a fully available mobility -as-a-service ( MaaS ) solution going forward? Q69: To what extent are you interested in giving up vehicle ownership in favour of subscribing to the use of a vehicle going forward?of customers are interested in giving up vehicle ownership in favour of subscribing to the use of a vehicle going forward. Interest in vehicle subscription 18–34 66% 35–54 64% 55 or above 55%of customers (71 percent for urban, 58 percent for suburban/rural) are willing to give up vehicle ownership in favour of a fully available MaaS solution going forward Interest in MaaS as primary transport 18–34 70% 35–54 69% 55 or above 63% The proportion of Indian customers willing to adopt MaaS as their primary mode of transport has declined from 82 percent recorded in the previous year.A slightly higher proportion of younger adults, compared with other age groups in India, are willing to give up vehicle ownership in favour of a subscription model68% 63% Source: Global Automobile Consumer Survey 2025",
    "page": 32,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 33Nearly two -thirds of customers expect to pay less than INR30,000 per month for their next vehicle, slightly lower than last year, indicating a growing premiumisation potential Sample size: n= 882Q39 How much do you intend to spend on a monthly vehicle payment/subscription (including all bundled products and services)?Consumer expectation regarding monthly vehicle payment Monthly vehicle payment/subscriptionOverall Less than INR10,000 22% INR10,000 to less than INR20,000 27% INR20,000 to less than INR30,000 19% INR30,000 to less than INR40,000 12% INR40,000 to less than INR50,000 10% INR50,000 or more 10%The proportion of respondents preferring to pay less than INR30,000 has declined from 73 percent to 68 percent this year. Source: Global Automobile Consumer Survey 2025",
    "page": 33,
    "is_structured": true
  },
  {
    "text": "About the study 2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 34",
    "page": 34,
    "is_structured": false,
    "start_word": 0,
    "end_word": 16
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 35About the study 75% 17% 9% Urban Suburban Rural40% 35%25% 18–34 35-54 55 or aboveAge group 48%Survey timing October to December 2024 Sample The survey polled a sample of 1,000 consumers in India. The survey has a margin of error for the entire sample of +/ - 3.1 percent. Methodology The study uses an online panel methodology. Consumers of driving age are invited to complete the questionnaire via email.52%Gender Location",
    "page": 35,
    "is_structured": true
  },
  {
    "text": "2025 Global Automotive Consumer Study © 2025 Deloitte Touche Tohmatsu India LLP. 36Rajat Mahajan Partner and Auto Sector Leader Deloitte India rajatm@deloitte.comConnect with us Atul Jairaj Partner Deloitte India ajairaj@deloitte.com Contributor Dr Moumita Paul Acknowledgments Mou Chakravorty Harsh Trivedi",
    "page": 36,
    "is_structured": false,
    "start_word": 0,
    "end_word": 39
  },
  {
    "text": "Deloitte refers to one or more of Deloitte Touche Tohmatsu Limited (“DTTL”), its global network of member firms, and their related entities (collectively, the “Deloitte organ ization”). DTTL (also referred to as “Deloitte Global”) and each of its member firms and related entities are legally separate and indep endent entities, which cannot obligate or bind each other in respect of third parties. DTTL and each DTTL member firm and related entity is liable only for its own acts and omissions, an d not those of each other. DTTL does not provide services to clients. Please see www.deloitte.com/about to learn more. Deloitte Asia Pacific Limited is a company limited by guarantee and a member firm of DTTL. Members of Deloitte Asia Pacific L imited and their related entities, each of which is a separate and independent legal entity, provide services from more than 100 cities across the region, including Auckland, Bang kok, Beijing, Bengaluru, Hanoi, Hong Kong, Jakarta, Kuala Lumpur, Manila, Melbourne, Mumbai, New Delhi, Osaka, Seoul, Shanghai, Singapore, Sydney, Taipei and Tokyo. This communication contains general information only, and none of DTTL, its global network of member firms or their related e ntities is, by means of this communication, rendering professional advice or services. Before making any decision or taking any action that may affect your finances or your busine ss, you should consult a qualified professional adviser. No representations, warranties or undertakings (express or implied) are given as to the accuracy or completeness of the infor mation in this communication, and none of DTTL, its member firms, related entities, employees or agents shall be liable or responsible for any loss or damage whatsoever arising directly or indirectly in connection with any person relying on this communication. © 2025 Deloitte Touche Tohmatsu India LLP. Member of Deloitte Touche Tohmatsu Limited",
    "page": 37,
    "is_structured": false,
    "start_word": 0,
    "end_word": 300
  }
]